app/controllers/projects_controller.rb

INSERT INTO "projects" ("title", "description", "created_at", "updated_at", "day", "event_type", "priority") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save

UPDATE "projects" SET "description" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["description", "Finish homework 6 in assembly. edit"], ["updated_at", "2023-04-29 00:14:11.837262"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @project.update(project_params)