app/controllers/projects_controller.rb

  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save
---
INSERT INTO "projects" ("title", "description", "created_at", "updated_at", "day", "event_type", "priority") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "t"], ["description", "test"], ["created_at", "2023-04-28 20:44:16.567013"], ["updated_at", "2023-04-28 20:44:16.567013"], ["day", "Monday"], ["event_type", "t"], ["priority", 2]]

  def update
    respond_to do |format|
      if @project.update(project_params)
---
UPDATE "projects" SET "description" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["description", "Finish the Bomb Lab in Assembly"], ["updated_at", "2023-04-28 20:48:23.058648"], ["id", 4]]